Revit 2026 API

# AdvancedWoodWoodFiberCosineProf Property

---

The property labeled "Profile for fiber cosine function" from the "AdvancedWood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WoodFiberCosineProf { get; }
```
```vb
Public Shared ReadOnly Property WoodFiberCosineProf As String
	Get
```
```cpp
public:
static property String^ WoodFiberCosineProf {
	String^ get ();
}
```
```fsharp
static member WoodFiberCosineProf : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble".

#### Reference

AdvancedWood Class

Autodesk.Revit.DB.Visual Namespace